[
  {
    "id": 1,
    "estate_title": "Fertile Agricultural Land in Rajshahi",
    "segment_name": "Agricultural Land",
    "description": "This 10-acre agricultural land in Rajshahi offers a prime opportunity for farmers, agribusiness investors, and individuals seeking to engage in large-scale cultivation. The soil is naturally fertile, enriched with nutrients, and has been proven to yield excellent harvests of rice, wheat, lentils, and seasonal vegetables. Farmers will benefit from an established irrigation system that ensures crops can thrive year-round, even during dry seasons. The property is strategically located close to Rajshahi’s local markets, allowing for easy and cost-effective transportation of fresh produce. Accessibility is another strength, with nearby road networks supporting logistics and equipment transport. Beyond conventional farming, the land has potential for organic farming, greenhouse cultivation, or even agro-forestry projects, providing long-term sustainable income opportunities. Given Bangladesh’s growing food demand, this property represents both a profitable business venture and a chance to contribute to food security. Whether purchased for personal farming, contract cultivation, or leasing, it holds immense promise.",
    "price": "$50,000",
    "status": "sale",
    "area": "10 acres",
    "location": "Rajshahi, Bangladesh",
    "facilities": ["Irrigation System", "Nearby Market", "Fertile Soil"],
    "button_text": "View Property",
    "image": "https://images.unsplash.com/photo-1621928372414-30e144d51d49?q=80&w=1554&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "owner": "GreenField Realty",
    "posted_date": "2025-08-25",
    "land_type": "Farming"
  },
  {
    "id": 2,
    "estate_title": "Spacious Ranch in Sylhet",
    "segment_name": "Ranches",
    "description": "This 15-acre ranch in Sylhet offers a wonderful investment for livestock farming, rural tourism, or sustainable agro-based projects. The lush green pastures are ideal for grazing cattle, goats, and sheep, ensuring that livestock remain healthy and productive throughout the year. A reliable water well on the property ensures a constant water supply for both animals and crops. The ranch also includes a cattle shed, designed to provide shelter and protection against harsh weather, minimizing the need for additional infrastructure investment. A strong boundary fence surrounds the land, ensuring safety for livestock while reducing risks from intruders or straying animals. Accessibility is excellent, with road connections to nearby villages and towns, allowing smooth transport of dairy products, meat, or other farm produce to local and regional markets. Investors may also consider eco-tourism, as the serene environment provides opportunities for farm stays or educational visits. With vast potential and existing facilities, this ranch is ready for development.",
    "price": "$120,000",
    "status": "sale",
    "area": "15 acres",
    "location": "Sylhet, Bangladesh",
    "facilities": ["Water Well", "Cattle Shed", "Boundary Fence"],
    "button_text": "View Property",
    "image": "https://images.unsplash.com/photo-1641694209007-0a7ee0fb3637?q=80&w=1168&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "owner": "Sylhet Agro Estates",
    "posted_date": "2025-08-24",
    "land_type": "Ranch"
  },
  {
    "id": 3,
    "estate_title": "Vineyard Land in Cox’s Bazar",
    "segment_name": "Vineyards",
    "description": "This 8-acre vineyard in Cox’s Bazar presents an extraordinary opportunity to own agricultural land with immense commercial and lifestyle value. The region’s climate—warm sunny days balanced by cool coastal breezes—makes it highly suitable for grape cultivation. The property is equipped with an efficient irrigation system, ensuring that vines receive consistent hydration to produce high-quality grapes. A dedicated storage house allows for safe handling of harvested crops and winemaking equipment. The included farmhouse provides comfort for owners or workers, making management much easier. Investors could explore grape-based product lines, including wine, juices, jams, or even organic grape exports. Additionally, the property’s natural beauty and proximity to the coast give it significant agro-tourism potential. Visitors could experience vineyard tours, tastings, or rural retreats, providing secondary income streams. With global demand for wine and fresh grapes increasing, this property offers a unique blend of profitable farming and lifestyle enjoyment in one of Bangladesh’s most scenic regions.",
    "price": "$200,000",
    "status": "sale",
    "area": "8 acres",
    "location": "Cox’s Bazar, Bangladesh",
    "facilities": ["Irrigation System", "Storage House", "Farmhouse"],
    "button_text": "View Property",
    "image": "https://images.unsplash.com/photo-1637181155600-f4487dabf8ba?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "owner": "Coastal Vineyards Ltd",
    "posted_date": "2025-08-20",
    "land_type": "Vineyard"
  },
  {
    "id": 4,
    "estate_title": "Forest Land in Chittagong Hill Tracts",
    "segment_name": "Forests",
    "description": "This 25-acre forest land in the scenic Bandarban area of the Chittagong Hill Tracts is a rare investment opportunity for eco-conscious buyers, conservationists, or tourism developers. The land is covered with lush greenery, offering an untouched natural habitat rich in biodiversity. A flowing natural stream within the property adds both beauty and practicality, serving as a water source for any eco-tourism or hospitality projects. Wildlife thrives here, making it ideal for conservation, research, or eco-parks. Existing hiking trails wind through the forest, providing ready-made attractions for tourists seeking adventure and nature experiences. With the growing popularity of eco-tourism in Bangladesh, this property can be developed into eco-lodges, camping sites, or nature retreats, attracting both local and international visitors. At the same time, it could be preserved for forestry projects, carbon credit initiatives, or sustainable logging under strict management. Offering both environmental and financial benefits, this property is a long-term investment in nature and profitability.",
    "price": "$300,000",
    "status": "sale",
    "area": "25 acres",
    "location": "Bandarban, Chittagong Hill Tracts",
    "facilities": ["Natural Water Stream", "Hiking Trails", "Wildlife Habitat"],
    "button_text": "View Property",
    "image": "https://images.unsplash.com/photo-1507810938996-e745c44f0863?q=80&w=1632&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "owner": "EcoLand Realty",
    "posted_date": "2025-08-18",
    "land_type": "Forest"
  },
  {
    "id": 5,
    "estate_title": "Tea Plantation in Moulvibazar",
    "segment_name": "Plantations",
    "description": "This 20-acre tea plantation in Moulvibazar, Sylhet, is a well-established agricultural estate that combines productivity with long-term investment value. The land is fully cultivated with mature tea bushes that consistently yield high-quality tea leaves, meeting both local and export market demand. The plantation includes housing facilities for workers, ensuring smooth operations and a dedicated workforce. A built-in processing unit further enhances the estate’s value by reducing transportation costs and increasing efficiency. The property also has irrigation facilities, safeguarding tea production during dry spells. Its location in Sylhet’s renowned tea belt adds prestige and guarantees strong market demand. Beyond tea farming, this land could support eco-tourism, as tea estates are increasingly popular for visitors seeking scenic beauty and authentic cultural experiences. Leasing or managing this estate offers immediate returns, while ownership ensures long-term profitability. This property provides an outstanding chance to invest in one of Bangladesh’s most iconic agricultural industries.",
    "price": "$180,000",
    "status": "rent",
    "area": "20 acres",
    "location": "Moulvibazar, Sylhet",
    "facilities": ["Worker Housing", "Processing Unit", "Irrigation System"],
    "button_text": "View Property",
    "image": "https://images.unsplash.com/photo-1612862862206-c0e196260dba?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "owner": "Sylhet Tea Estates",
    "posted_date": "2025-08-15",
    "land_type": "Plantation"
  },
  {
    "id": 6,
    "estate_title": "Farm Land with Modern Facilities",
    "segment_name": "Farms",
    "description": "This 12-acre farmland in Gazipur, near Dhaka, combines traditional agricultural value with modern technological support. The land is highly fertile and suitable for a variety of crops, from vegetables and grains to cash crops. A modern irrigation system ensures water availability throughout the year, enabling multiple harvests. Additionally, solar panels installed on the property provide eco-friendly power solutions, reducing operational costs and offering sustainable energy. The farmhouse within the property is well-built and can serve as both accommodation and an operational center, making it convenient for farm managers or owners to oversee daily work. The farm’s location near Dhaka ensures excellent market access, meaning produce can quickly reach urban consumers. Beyond crop farming, this land is also well-suited for poultry, fisheries, or livestock. With infrastructure already in place and strategic proximity to the capital city, this property is ideal for entrepreneurs looking to merge agriculture with modern business practices.",
    "price": "$150,000",
    "status": "sale",
    "area": "12 acres",
    "location": "Gazipur, Dhaka",
    "facilities": ["Farmhouse", "Solar Power", "Irrigation System"],
    "button_text": "View Property",
    "image": "https://images.unsplash.com/photo-1609784431920-300d0d4b5bf0?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "owner": "AgroSmart Properties",
    "posted_date": "2025-08-10",
    "land_type": "Farm"
  },
  {
    "id": 7,
    "estate_title": "Mango Orchard Land in Chapainawabganj",
    "segment_name": "Orchards",
    "description": "This 15-acre mango orchard in Chapainawabganj, often called the mango capital of Bangladesh, is a highly valuable property for both agriculture and business investment. The orchard is filled with mature mango trees that consistently produce large quantities of high-quality mangoes every season. The land benefits from an efficient irrigation system, ensuring reliable yields even during dry weather. Additional facilities include a storage shed for harvested produce and dedicated quarters for farm workers, making operations smoother and more efficient. Chapainawabganj’s reputation for producing premium mangoes ensures strong market demand, both domestically and internationally. This orchard has the potential to support direct sales, export, or even mango-based value-added products like juices, jams, and dried mangoes. With proper management, the orchard can generate significant annual income. Its established trees, infrastructure, and prime location make it a ready-to-use investment that combines tradition, profitability, and sustainability in Bangladesh’s agricultural sector.",
    "price": "$170,000",
    "status": "sale",
    "area": "15 acres",
    "location": "Chapainawabganj, Bangladesh",
    "facilities": ["Irrigation System", "Storage Shed", "Farm Workers’ Quarters"],
    "button_text": "View Property",
    "image": "https://images.unsplash.com/photo-1600917016506-556622b74303?q=80&w=1171&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "owner": "Nawabganj Orchards Ltd",
    "posted_date": "2025-08-12",
    "land_type": "Orchard"
  },
  {
    "id": 8,
    "estate_title": "Eco-Friendly Bamboo Plantation",
    "segment_name": "Plantations",
    "description": "This 10-acre bamboo plantation in Rangamati is designed with sustainability and eco-production in mind. Bamboo, being one of the fastest-growing plants in the world, makes this land an excellent investment for eco-friendly construction, furniture, handicrafts, and paper industries. The property enjoys natural irrigation from nearby water sources, ensuring steady growth without the need for costly artificial systems. Easy road access improves transportation and logistics, making it convenient for commercial operations. A small caretaker’s hut is already on-site, providing housing for workers and adding security to the plantation. Investors could expand into bamboo-based product manufacturing or partner with green companies that specialize in eco-friendly exports. The property is also suitable for eco-tourism or research purposes, as bamboo forests attract nature enthusiasts and sustainable living advocates. With global demand for renewable resources increasing, this plantation represents a future-oriented business opportunity that balances profit with environmental responsibility.",
    "price": "$95,000",
    "status": "sale",
    "area": "10 acres",
    "location": "Rangamati, Bangladesh",
    "facilities": ["Natural Irrigation", "Road Access", "Caretaker’s Hut"],
    "button_text": "View Property",
    "image": "https://images.unsplash.com/photo-1612862862206-c0e196260dba?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "owner": "Eco Bamboo Estates",
    "posted_date": "2025-08-19",
    "land_type": "Plantation"
  },
  {
    "id": 9,
    "estate_title": "Coconut Grove Near Khulna",
    "segment_name": "Plantations",
    "description": "This 12-acre coconut grove near Khulna is a promising investment for individuals or companies interested in long-term agricultural ventures. The land is filled with high-yielding coconut trees that consistently produce large harvests of coconuts, meeting both food and industrial demand. Water access for irrigation is available, ensuring stable productivity across all seasons. A storage facility within the property provides space for harvested coconuts, oils, or other coconut-based products, while caretaker housing ensures smooth day-to-day management. The location is easily accessible, making transportation to Khulna’s markets or ports efficient and cost-effective. Coconut farming offers diverse income opportunities, including fresh coconuts, coconut oil, coir products, and even coconut-based beverages. With the rising demand for natural and organic products, this grove can easily be expanded into an export-oriented business. Whether you are looking for agricultural income, a processing unit, or an eco-friendly investment, this property delivers both profitability and sustainability.",
    "price": "$140,000",
    "status": "rent",
    "area": "12 acres",
    "location": "Khulna, Bangladesh",
    "facilities": ["Water Supply", "Storage Facility", "Caretaker Housing"],
    "button_text": "View Property",
    "image": "https://images.unsplash.com/photo-1542601906990-b4d3fb778b09?q=80&w=1613&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "owner": "Khulna Green Farms",
    "posted_date": "2025-08-22",
    "land_type": "Plantation"
  }
]
